app/views/users/myprofile.html.haml

    %h5 Cocktails:
    - if @user.cocktails.size == 0
---
SELECT "cocktails".* FROM "cocktails" WHERE "cocktails"."user_id" = ?  [["user_id", 4]]
SELECT COUNT(*) FROM "cocktails" WHERE "cocktails"."user_id" = ?  [["user_id", 4]]

    %h5 Reviews:
    - if @user.reviews.size == 0
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."user_id" = ?  [["user_id", 3]]
SELECT COUNT(*) FROM "reviews" WHERE "reviews"."user_id" = ?  [["user_id", 4]]