app/controllers/cocktails_controller.rb

    def create
        @cocktail = current_user.cocktails.build(cocktail_params)
        @cocktail.video = Video.new(video_params)
        if @cocktail.save
---
INSERT INTO "cocktails" ("name", "description", "creation_date", "user_id", "image") VALUES (?, ?, ?, ?, ?)  [["name", "mycock tail"], ["description", "ciao cock tail"], ["creation_date", "2018-05-16 00:00:00"], ["user_id", 3], ["image", nil]]

    def show
      begin
        id = params[:id]
        @cocktail = Cocktail.find(id)
        respond_to do |format|
          # some other formats like: format.html { render :show }
          format.html.haml
          format.pdf do
            pdf = Prawn::Document.new(:page_layout => :landscape)
            pdf.text "Details about cocktail '#{@cocktail.name}'\n", :size => 29, :align => :center
            pdf.text "Created by '#{@cocktail.user.username}'\n\n\n", :size => 20, :align => :center
            pdf.text "Description: #{@cocktail.description}\n\n", :size => 20
            if !@cocktail.image.nil?
              if @cocktail.image.url.include? "public"
---
SELECT  "cocktails".* FROM "cocktails" WHERE "cocktails"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def destroy
      begin
        @cocktail = Cocktail.find(params[:id])
        @cocktail.destroy
---
SELECT  "cocktails".* FROM "cocktails" WHERE "cocktails"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "cocktails" WHERE "cocktails"."id" = ?  [["id", 1]]

    def edit
      begin
        @cocktail = Cocktail.find params[:id]
---
SELECT  "cocktails".* FROM "cocktails" WHERE "cocktails"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

    def update
      begin
        @cocktail = Cocktail.find params[:id]
        if !(params[:cocktail][:link].blank?) && (params[:cocktail][:link] != @cocktail.link)
          @cocktail.video = Video.new(video_params) unless frozen?
        end

        if @cocktail.update_attributes(cocktail_params)
---
SELECT  "cocktails".* FROM "cocktails" WHERE "cocktails"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "cocktails" SET "name" = ? WHERE "cocktails"."id" = ?  [["name", "Ciao cocktail2 mio"], ["id", 2]]