app/controllers/reviews_controller.rb

SELECT  "cocktails".* FROM "cocktails" WHERE "cocktails"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]
---
    def find_cocktail
        unless (@cocktail = Cocktail.find_by(:id => params[:cocktail_id]))

SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "reviews" SET "rate" = ?, "comments" = ? WHERE "reviews"."id" = ?  [["rate", 1], ["comments", "ddd"], ["id", 4]]
---
    def update
        @review = Review.find params[:id]

        @review.update_attributes!(review_params)

INSERT INTO "reviews" ("rate", "comments", "cocktail_id", "user_id") VALUES (?, ?, ?, ?)  [["rate", 1], ["comments", "i"], ["cocktail_id", 16], ["user_id", 4]]
---
    def create
        current_user.reviews << @cocktail.reviews.build(review_params)

SELECT  "reviews".* FROM "reviews" WHERE "reviews"."cocktail_id" = ? AND "reviews"."id" = ? LIMIT ?  [["cocktail_id", 16], ["id", 16], ["LIMIT", 1]]
DELETE FROM "reviews" WHERE "reviews"."id" = ?  [["id", 1]]
---
    def destroy
        @review = @cocktail.reviews.find(params[:id])
        @review.destroy