app/views/reviews/index.html.haml

SELECT  "reviews".* FROM "reviews" WHERE "reviews"."cocktail_id" = ? AND "reviews"."id" = ? LIMIT ?  [["cocktail_id", 16], ["id", nil], ["LIMIT", 1]]
---
%h2 Reviews for #{@cocktail.name}
- if @cocktail.reviews.first == nil

SELECT  "reviews".* FROM "reviews" WHERE "reviews"."cocktail_id" = ? AND "reviews"."user_id" = ? LIMIT ?  [["cocktail_id", 16], ["user_id", 4], ["LIMIT", 1]]
SELECT  "cocktails".* FROM "cocktails" WHERE "cocktails"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
- if current_user
    - if Review.find_by(:cocktail_id => @cocktail.id, :user_id => current_user.id) == nil
        - if Cocktail.find_by(:id => @cocktail.id).user.id != current_user.id